GopalSaraf/Practicals/PSDL/include/proc/pic16f18876.h
// Register: IOCEF
#define IOCEF IOCEF
extern volatile unsigned char           IOCEF               __at(0xF6B);
#ifndef _LIB_BUILD
asm("IOCEF equ 0F6Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned IOCEF3                 :1;
    };
} IOCEFbits_t;
extern volatile IOCEFbits_t IOCEFbits __at(0xF6B);
// bitfield macros
#define _IOCEF_IOCEF3_POSN                                  0x3
#define _IOCEF_IOCEF3_POSITION                              0x3
#define _IOCEF_IOCEF3_SIZE                                  0x1
#define _IOCEF_IOCEF3_LENGTH                                0x1
#define _IOCEF_IOCEF3_MASK                                  0x8

// Register: CCDNE
#define CCDNE CCDNE
extern volatile unsigned char           CCDNE               __at(0xF6C);
#ifndef _LIB_BUILD
asm("CCDNE equ 0F6Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCDNE0                 :1;
        unsigned CCDNE1                 :1;
        unsigned CCDNE2                 :1;
    };
} CCDNEbits_t;
extern volatile CCDNEbits_t CCDNEbits __at(0xF6C);
// bitfield macros
#define _CCDNE_CCDNE0_POSN                                  0x0
#define _CCDNE_CCDNE0_POSITION                              0x0
#define _CCDNE_CCDNE0_SIZE                                  0x1
#define _CCDNE_CCDNE0_LENGTH                                0x1
#define _CCDNE_CCDNE0_MASK                                  0x1
#define _CCDNE_CCDNE1_POSN                                  0x1
#define _CCDNE_CCDNE1_POSITION                              0x1
#define _CCDNE_CCDNE1_SIZE                                  0x1
#define _CCDNE_CCDNE1_LENGTH                                0x1
#define _CCDNE_CCDNE1_MASK                                  0x2
#define _CCDNE_CCDNE2_POSN                                  0x2
#define _CCDNE_CCDNE2_POSITION                              0x2
#define _CCDNE_CCDNE2_SIZE                                  0x1
#define _CCDNE_CCDNE2_LENGTH                                0x1
#define _CCDNE_CCDNE2_MASK                                  0x4

// Register: CCDPE
#define CCDPE CCDPE
extern volatile unsigned char           CCDPE               __at(0xF6D);
#ifndef _LIB_BUILD
asm("CCDPE equ 0F6Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCDPE0                 :1;
        unsigned CCDPE1                 :1;
        unsigned CCDPE2                 :1;
    };
} CCDPEbits_t;
extern volatile CCDPEbits_t CCDPEbits __at(0xF6D);
// bitfield macros
#define _CCDPE_CCDPE0_POSN                                  0x0
#define _CCDPE_CCDPE0_POSITION                              0x0
#define _CCDPE_CCDPE0_SIZE                                  0x1
#define _CCDPE_CCDPE0_LENGTH                                0x1
#define _CCDPE_CCDPE0_MASK                                  0x1
#define _CCDPE_CCDPE1_POSN                                  0x1
#define _CCDPE_CCDPE1_POSITION                              0x1
#define _CCDPE_CCDPE1_SIZE                                  0x1
#define _CCDPE_CCDPE1_LENGTH                                0x1
#define _CCDPE_CCDPE1_MASK                                  0x2
#define _CCDPE_CCDPE2_POSN                                  0x2
#define _CCDPE_CCDPE2_POSITION                              0x2
#define _CCDPE_CCDPE2_SIZE                                  0x1
#define _CCDPE_CCDPE2_LENGTH                                0x1
#define _CCDPE_CCDPE2_MASK                                  0x4

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
extern volatile unsigned char           STATUS_SHAD         __at(0xFE4);
#ifndef _LIB_BUILD
asm("STATUS_SHAD equ 0FE4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C_SHAD                 :1;
        unsigned DC_SHAD                :1;
        unsigned Z_SHAD                 :1;
    };
} STATUS_SHADbits_t;
extern volatile STATUS_SHADbits_t STATUS_SHADbits __at(0xFE4);
// bitfield macros
#define _STATUS_SHAD_C_SHAD_POSN                            0x0
#define _STATUS_SHAD_C_SHAD_POSITION                        0x0
#define _STATUS_SHAD_C_SHAD_SIZE                            0x1
#define _STATUS_SHAD_C_SHAD_LENGTH                          0x1
#define _STATUS_SHAD_C_SHAD_MASK                            0x1
#define _STATUS_SHAD_DC_SHAD_POSN                           0x1
#define _STATUS_SHAD_DC_SHAD_POSITION                       0x1
#define _STATUS_SHAD_DC_SHAD_SIZE                           0x1
#define _STATUS_SHAD_DC_SHAD_LENGTH                         0x1
#define _STATUS_SHAD_DC_SHAD_MASK                           0x2
#define _STATUS_SHAD_Z_SHAD_POSN                            0x2
#define _STATUS_SHAD_Z_SHAD_POSITION                        0x2
#define _STATUS_SHAD_Z_SHAD_SIZE                            0x1
#define _STATUS_SHAD_Z_SHAD_LENGTH                          0x1
#define _STATUS_SHAD_Z_SHAD_MASK                            0x4

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
extern volatile unsigned char           WREG_SHAD           __at(0xFE5);
#ifndef _LIB_BUILD
asm("WREG_SHAD equ 0FE5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WREG_SHAD              :8;
    };
} WREG_SHADbits_t;
extern volatile WREG_SHADbits_t WREG_SHADbits __at(0xFE5);
// bitfield macros
#define _WREG_SHAD_WREG_SHAD_POSN                           0x0
#define _WREG_SHAD_WREG_SHAD_POSITION                       0x0
#define _WREG_SHAD_WREG_SHAD_SIZE                           0x8
#define _WREG_SHAD_WREG_SHAD_LENGTH                         0x8
#define _WREG_SHAD_WREG_SHAD_MASK                           0xFF

// Register: BSR_SHAD
#define BSR_SHAD BSR_SHAD
extern volatile unsigned char           BSR_SHAD            __at(0xFE6);
#ifndef _LIB_BUILD
asm("BSR_SHAD equ 0FE6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BSR_SHAD               :5;
    };
} BSR_SHADbits_t;
extern volatile BSR_SHADbits_t BSR_SHADbits __at(0xFE6);
// bitfield macros
#define _BSR_SHAD_BSR_SHAD_POSN                             0x0
#define _BSR_SHAD_BSR_SHAD_POSITION                         0x0
#define _BSR_SHAD_BSR_SHAD_SIZE                             0x5
#define _BSR_SHAD_BSR_SHAD_LENGTH                           0x5
#define _BSR_SHAD_BSR_SHAD_MASK                             0x1F

// Register: PCLATH_SHAD
#define PCLATH_SHAD PCLATH_SHAD
extern volatile unsigned char           PCLATH_SHAD         __at(0xFE7);
#ifndef _LIB_BUILD
asm("PCLATH_SHAD equ 0FE7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCLATH_SHAD            :7;
    };
} PCLATH_SHADbits_t;
