GopalSaraf/Practicals/PSDL/include/proc/pic16f18876.h
extern volatile __bit                   RB4PPS3             __at(0x78E3);	// @ (0xF1C * 8 + 3)
#define                                 RB4PPS3_bit         _BIT_ACCESS(RB4PPS,3)
// RB4PPS<RB4PPS4>
extern volatile __bit                   RB4PPS4             __at(0x78E4);	// @ (0xF1C * 8 + 4)
#define                                 RB4PPS4_bit         _BIT_ACCESS(RB4PPS,4)
// RB4PPS<RB4PPS5>
extern volatile __bit                   RB4PPS5             __at(0x78E5);	// @ (0xF1C * 8 + 5)
#define                                 RB4PPS5_bit         _BIT_ACCESS(RB4PPS,5)
// PORTB<RB5>
extern volatile __bit                   RB5                 __at(0x6D);	// @ (0xD * 8 + 5)
#define                                 RB5_bit             _BIT_ACCESS(PORTB,5)
// RB5PPS<RB5PPS0>
extern volatile __bit                   RB5PPS0             __at(0x78E8);	// @ (0xF1D * 8 + 0)
#define                                 RB5PPS0_bit         _BIT_ACCESS(RB5PPS,0)
// RB5PPS<RB5PPS1>
extern volatile __bit                   RB5PPS1             __at(0x78E9);	// @ (0xF1D * 8 + 1)
#define                                 RB5PPS1_bit         _BIT_ACCESS(RB5PPS,1)
// RB5PPS<RB5PPS2>
extern volatile __bit                   RB5PPS2             __at(0x78EA);	// @ (0xF1D * 8 + 2)
#define                                 RB5PPS2_bit         _BIT_ACCESS(RB5PPS,2)
// RB5PPS<RB5PPS3>
extern volatile __bit                   RB5PPS3             __at(0x78EB);	// @ (0xF1D * 8 + 3)
#define                                 RB5PPS3_bit         _BIT_ACCESS(RB5PPS,3)
// RB5PPS<RB5PPS4>
extern volatile __bit                   RB5PPS4             __at(0x78EC);	// @ (0xF1D * 8 + 4)
#define                                 RB5PPS4_bit         _BIT_ACCESS(RB5PPS,4)
// RB5PPS<RB5PPS5>
extern volatile __bit                   RB5PPS5             __at(0x78ED);	// @ (0xF1D * 8 + 5)
#define                                 RB5PPS5_bit         _BIT_ACCESS(RB5PPS,5)
// PORTB<RB6>
extern volatile __bit                   RB6                 __at(0x6E);	// @ (0xD * 8 + 6)
#define                                 RB6_bit             _BIT_ACCESS(PORTB,6)
// RB6PPS<RB6PPS0>
extern volatile __bit                   RB6PPS0             __at(0x78F0);	// @ (0xF1E * 8 + 0)
#define                                 RB6PPS0_bit         _BIT_ACCESS(RB6PPS,0)
// RB6PPS<RB6PPS1>
extern volatile __bit                   RB6PPS1             __at(0x78F1);	// @ (0xF1E * 8 + 1)
#define                                 RB6PPS1_bit         _BIT_ACCESS(RB6PPS,1)
// RB6PPS<RB6PPS2>
extern volatile __bit                   RB6PPS2             __at(0x78F2);	// @ (0xF1E * 8 + 2)
#define                                 RB6PPS2_bit         _BIT_ACCESS(RB6PPS,2)
// RB6PPS<RB6PPS3>
extern volatile __bit                   RB6PPS3             __at(0x78F3);	// @ (0xF1E * 8 + 3)
#define                                 RB6PPS3_bit         _BIT_ACCESS(RB6PPS,3)
// RB6PPS<RB6PPS4>
extern volatile __bit                   RB6PPS4             __at(0x78F4);	// @ (0xF1E * 8 + 4)
#define                                 RB6PPS4_bit         _BIT_ACCESS(RB6PPS,4)
// RB6PPS<RB6PPS5>
extern volatile __bit                   RB6PPS5             __at(0x78F5);	// @ (0xF1E * 8 + 5)
#define                                 RB6PPS5_bit         _BIT_ACCESS(RB6PPS,5)
// PORTB<RB7>
extern volatile __bit                   RB7                 __at(0x6F);	// @ (0xD * 8 + 7)
#define                                 RB7_bit             _BIT_ACCESS(PORTB,7)
// RB7PPS<RB7PPS0>
extern volatile __bit                   RB7PPS0             __at(0x78F8);	// @ (0xF1F * 8 + 0)
#define                                 RB7PPS0_bit         _BIT_ACCESS(RB7PPS,0)
// RB7PPS<RB7PPS1>
extern volatile __bit                   RB7PPS1             __at(0x78F9);	// @ (0xF1F * 8 + 1)
#define                                 RB7PPS1_bit         _BIT_ACCESS(RB7PPS,1)
// RB7PPS<RB7PPS2>
extern volatile __bit                   RB7PPS2             __at(0x78FA);	// @ (0xF1F * 8 + 2)
#define                                 RB7PPS2_bit         _BIT_ACCESS(RB7PPS,2)
// RB7PPS<RB7PPS3>
extern volatile __bit                   RB7PPS3             __at(0x78FB);	// @ (0xF1F * 8 + 3)
#define                                 RB7PPS3_bit         _BIT_ACCESS(RB7PPS,3)
// RB7PPS<RB7PPS4>
extern volatile __bit                   RB7PPS4             __at(0x78FC);	// @ (0xF1F * 8 + 4)
#define                                 RB7PPS4_bit         _BIT_ACCESS(RB7PPS,4)
// RB7PPS<RB7PPS5>
extern volatile __bit                   RB7PPS5             __at(0x78FD);	// @ (0xF1F * 8 + 5)
#define                                 RB7PPS5_bit         _BIT_ACCESS(RB7PPS,5)
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x70);	// @ (0xE * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// RC0PPS<RC0PPS0>
extern volatile __bit                   RC0PPS0             __at(0x7900);	// @ (0xF20 * 8 + 0)
#define                                 RC0PPS0_bit         _BIT_ACCESS(RC0PPS,0)
// RC0PPS<RC0PPS1>
extern volatile __bit                   RC0PPS1             __at(0x7901);	// @ (0xF20 * 8 + 1)
#define                                 RC0PPS1_bit         _BIT_ACCESS(RC0PPS,1)
// RC0PPS<RC0PPS2>
extern volatile __bit                   RC0PPS2             __at(0x7902);	// @ (0xF20 * 8 + 2)
#define                                 RC0PPS2_bit         _BIT_ACCESS(RC0PPS,2)
// RC0PPS<RC0PPS3>
extern volatile __bit                   RC0PPS3             __at(0x7903);	// @ (0xF20 * 8 + 3)
#define                                 RC0PPS3_bit         _BIT_ACCESS(RC0PPS,3)
// RC0PPS<RC0PPS4>
extern volatile __bit                   RC0PPS4             __at(0x7904);	// @ (0xF20 * 8 + 4)
#define                                 RC0PPS4_bit         _BIT_ACCESS(RC0PPS,4)
// RC0PPS<RC0PPS5>
extern volatile __bit                   RC0PPS5             __at(0x7905);	// @ (0xF20 * 8 + 5)
#define                                 RC0PPS5_bit         _BIT_ACCESS(RC0PPS,5)
// PORTC<RC1>
extern volatile __bit                   RC1                 __at(0x71);	// @ (0xE * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// RC1PPS<RC1PPS0>
extern volatile __bit                   RC1PPS0             __at(0x7908);	// @ (0xF21 * 8 + 0)
#define                                 RC1PPS0_bit         _BIT_ACCESS(RC1PPS,0)
// RC1PPS<RC1PPS1>
extern volatile __bit                   RC1PPS1             __at(0x7909);	// @ (0xF21 * 8 + 1)
#define                                 RC1PPS1_bit         _BIT_ACCESS(RC1PPS,1)
// RC1PPS<RC1PPS2>
extern volatile __bit                   RC1PPS2             __at(0x790A);	// @ (0xF21 * 8 + 2)
#define                                 RC1PPS2_bit         _BIT_ACCESS(RC1PPS,2)
// RC1PPS<RC1PPS3>
extern volatile __bit                   RC1PPS3             __at(0x790B);	// @ (0xF21 * 8 + 3)
#define                                 RC1PPS3_bit         _BIT_ACCESS(RC1PPS,3)
// RC1PPS<RC1PPS4>
extern volatile __bit                   RC1PPS4             __at(0x790C);	// @ (0xF21 * 8 + 4)
#define                                 RC1PPS4_bit         _BIT_ACCESS(RC1PPS,4)
// RC1PPS<RC1PPS5>
extern volatile __bit                   RC1PPS5             __at(0x790D);	// @ (0xF21 * 8 + 5)
#define                                 RC1PPS5_bit         _BIT_ACCESS(RC1PPS,5)
// PORTC<RC2>
extern volatile __bit                   RC2                 __at(0x72);	// @ (0xE * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
// RC2PPS<RC2PPS0>
extern volatile __bit                   RC2PPS0             __at(0x7910);	// @ (0xF22 * 8 + 0)
#define                                 RC2PPS0_bit         _BIT_ACCESS(RC2PPS,0)
// RC2PPS<RC2PPS1>
extern volatile __bit                   RC2PPS1             __at(0x7911);	// @ (0xF22 * 8 + 1)
#define                                 RC2PPS1_bit         _BIT_ACCESS(RC2PPS,1)
// RC2PPS<RC2PPS2>
extern volatile __bit                   RC2PPS2             __at(0x7912);	// @ (0xF22 * 8 + 2)
#define                                 RC2PPS2_bit         _BIT_ACCESS(RC2PPS,2)
// RC2PPS<RC2PPS3>
extern volatile __bit                   RC2PPS3             __at(0x7913);	// @ (0xF22 * 8 + 3)
#define                                 RC2PPS3_bit         _BIT_ACCESS(RC2PPS,3)
// RC2PPS<RC2PPS4>
extern volatile __bit                   RC2PPS4             __at(0x7914);	// @ (0xF22 * 8 + 4)
#define                                 RC2PPS4_bit         _BIT_ACCESS(RC2PPS,4)
// RC2PPS<RC2PPS5>
extern volatile __bit                   RC2PPS5             __at(0x7915);	// @ (0xF22 * 8 + 5)
#define                                 RC2PPS5_bit         _BIT_ACCESS(RC2PPS,5)
// PORTC<RC3>
extern volatile __bit                   RC3                 __at(0x73);	// @ (0xE * 8 + 3)
#define                                 RC3_bit             _BIT_ACCESS(PORTC,3)
// RC3PPS<RC3PPS0>
extern volatile __bit                   RC3PPS0             __at(0x7918);	// @ (0xF23 * 8 + 0)
#define                                 RC3PPS0_bit         _BIT_ACCESS(RC3PPS,0)
// RC3PPS<RC3PPS1>
extern volatile __bit                   RC3PPS1             __at(0x7919);	// @ (0xF23 * 8 + 1)
#define                                 RC3PPS1_bit         _BIT_ACCESS(RC3PPS,1)
// RC3PPS<RC3PPS2>
extern volatile __bit                   RC3PPS2             __at(0x791A);	// @ (0xF23 * 8 + 2)
#define                                 RC3PPS2_bit         _BIT_ACCESS(RC3PPS,2)
// RC3PPS<RC3PPS3>
extern volatile __bit                   RC3PPS3             __at(0x791B);	// @ (0xF23 * 8 + 3)
#define                                 RC3PPS3_bit         _BIT_ACCESS(RC3PPS,3)
// RC3PPS<RC3PPS4>
extern volatile __bit                   RC3PPS4             __at(0x791C);	// @ (0xF23 * 8 + 4)
#define                                 RC3PPS4_bit         _BIT_ACCESS(RC3PPS,4)
// RC3PPS<RC3PPS5>
extern volatile __bit                   RC3PPS5             __at(0x791D);	// @ (0xF23 * 8 + 5)
#define                                 RC3PPS5_bit         _BIT_ACCESS(RC3PPS,5)
// PORTC<RC4>
extern volatile __bit                   RC4                 __at(0x74);	// @ (0xE * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// RC4PPS<RC4PPS0>
extern volatile __bit                   RC4PPS0             __at(0x7920);	// @ (0xF24 * 8 + 0)
#define                                 RC4PPS0_bit         _BIT_ACCESS(RC4PPS,0)
// RC4PPS<RC4PPS1>
extern volatile __bit                   RC4PPS1             __at(0x7921);	// @ (0xF24 * 8 + 1)
#define                                 RC4PPS1_bit         _BIT_ACCESS(RC4PPS,1)
// RC4PPS<RC4PPS2>
extern volatile __bit                   RC4PPS2             __at(0x7922);	// @ (0xF24 * 8 + 2)
#define                                 RC4PPS2_bit         _BIT_ACCESS(RC4PPS,2)
// RC4PPS<RC4PPS3>
extern volatile __bit                   RC4PPS3             __at(0x7923);	// @ (0xF24 * 8 + 3)
#define                                 RC4PPS3_bit         _BIT_ACCESS(RC4PPS,3)
// RC4PPS<RC4PPS4>
extern volatile __bit                   RC4PPS4             __at(0x7924);	// @ (0xF24 * 8 + 4)
#define                                 RC4PPS4_bit         _BIT_ACCESS(RC4PPS,4)
// RC4PPS<RC4PPS5>
extern volatile __bit                   RC4PPS5             __at(0x7925);	// @ (0xF24 * 8 + 5)
#define                                 RC4PPS5_bit         _BIT_ACCESS(RC4PPS,5)
// PORTC<RC5>
extern volatile __bit                   RC5                 __at(0x75);	// @ (0xE * 8 + 5)
#define                                 RC5_bit             _BIT_ACCESS(PORTC,5)
// RC5PPS<RC5PPS0>
extern volatile __bit                   RC5PPS0             __at(0x7928);	// @ (0xF25 * 8 + 0)
#define                                 RC5PPS0_bit         _BIT_ACCESS(RC5PPS,0)
// RC5PPS<RC5PPS1>
extern volatile __bit                   RC5PPS1             __at(0x7929);	// @ (0xF25 * 8 + 1)
#define                                 RC5PPS1_bit         _BIT_ACCESS(RC5PPS,1)
// RC5PPS<RC5PPS2>
extern volatile __bit                   RC5PPS2             __at(0x792A);	// @ (0xF25 * 8 + 2)
#define                                 RC5PPS2_bit         _BIT_ACCESS(RC5PPS,2)
// RC5PPS<RC5PPS3>
extern volatile __bit                   RC5PPS3             __at(0x792B);	// @ (0xF25 * 8 + 3)
#define                                 RC5PPS3_bit         _BIT_ACCESS(RC5PPS,3)
// RC5PPS<RC5PPS4>
extern volatile __bit                   RC5PPS4             __at(0x792C);	// @ (0xF25 * 8 + 4)
#define                                 RC5PPS4_bit         _BIT_ACCESS(RC5PPS,4)
// RC5PPS<RC5PPS5>
extern volatile __bit                   RC5PPS5             __at(0x792D);	// @ (0xF25 * 8 + 5)
#define                                 RC5PPS5_bit         _BIT_ACCESS(RC5PPS,5)
// PORTC<RC6>
extern volatile __bit                   RC6                 __at(0x76);	// @ (0xE * 8 + 6)
#define                                 RC6_bit             _BIT_ACCESS(PORTC,6)
// RC6PPS<RC6PPS0>
extern volatile __bit                   RC6PPS0             __at(0x7930);	// @ (0xF26 * 8 + 0)
#define                                 RC6PPS0_bit         _BIT_ACCESS(RC6PPS,0)
// RC6PPS<RC6PPS1>
extern volatile __bit                   RC6PPS1             __at(0x7931);	// @ (0xF26 * 8 + 1)
#define                                 RC6PPS1_bit         _BIT_ACCESS(RC6PPS,1)
// RC6PPS<RC6PPS2>
extern volatile __bit                   RC6PPS2             __at(0x7932);	// @ (0xF26 * 8 + 2)
#define                                 RC6PPS2_bit         _BIT_ACCESS(RC6PPS,2)
// RC6PPS<RC6PPS3>
extern volatile __bit                   RC6PPS3             __at(0x7933);	// @ (0xF26 * 8 + 3)
#define                                 RC6PPS3_bit         _BIT_ACCESS(RC6PPS,3)
// RC6PPS<RC6PPS4>
extern volatile __bit                   RC6PPS4             __at(0x7934);	// @ (0xF26 * 8 + 4)
#define                                 RC6PPS4_bit         _BIT_ACCESS(RC6PPS,4)
// RC6PPS<RC6PPS5>
extern volatile __bit                   RC6PPS5             __at(0x7935);	// @ (0xF26 * 8 + 5)
#define                                 RC6PPS5_bit         _BIT_ACCESS(RC6PPS,5)
// PORTC<RC7>
extern volatile __bit                   RC7                 __at(0x77);	// @ (0xE * 8 + 7)
#define                                 RC7_bit             _BIT_ACCESS(PORTC,7)
// RC7PPS<RC7PPS0>
extern volatile __bit                   RC7PPS0             __at(0x7938);	// @ (0xF27 * 8 + 0)
#define                                 RC7PPS0_bit         _BIT_ACCESS(RC7PPS,0)
// RC7PPS<RC7PPS1>
extern volatile __bit                   RC7PPS1             __at(0x7939);	// @ (0xF27 * 8 + 1)
#define                                 RC7PPS1_bit         _BIT_ACCESS(RC7PPS,1)
// RC7PPS<RC7PPS2>
extern volatile __bit                   RC7PPS2             __at(0x793A);	// @ (0xF27 * 8 + 2)
#define                                 RC7PPS2_bit         _BIT_ACCESS(RC7PPS,2)
// RC7PPS<RC7PPS3>
extern volatile __bit                   RC7PPS3             __at(0x793B);	// @ (0xF27 * 8 + 3)
#define                                 RC7PPS3_bit         _BIT_ACCESS(RC7PPS,3)
// RC7PPS<RC7PPS4>
extern volatile __bit                   RC7PPS4             __at(0x793C);	// @ (0xF27 * 8 + 4)
#define                                 RC7PPS4_bit         _BIT_ACCESS(RC7PPS,4)
// RC7PPS<RC7PPS5>
extern volatile __bit                   RC7PPS5             __at(0x793D);	// @ (0xF27 * 8 + 5)
#define                                 RC7PPS5_bit         _BIT_ACCESS(RC7PPS,5)
// SSP1CON2<RCEN1>
extern volatile __bit                   RCEN1               __at(0xC8B);	// @ (0x191 * 8 + 3)
#define                                 RCEN1_bit           _BIT_ACCESS(SSP1CON2,3)
// SSP2CON2<RCEN2>
extern volatile __bit                   RCEN2               __at(0xCDB);	// @ (0x19B * 8 + 3)
#define                                 RCEN2_bit           _BIT_ACCESS(SSP2CON2,3)
// BAUD1CON<RCIDL>
extern volatile __bit                   RCIDL               __at(0x8FE);	// @ (0x11F * 8 + 6)
#define                                 RCIDL_bit           _BIT_ACCESS(BAUD1CON,6)
// PIE3<RCIE>
extern volatile __bit                   RCIE                __at(0x38CD);	// @ (0x719 * 8 + 5)
#define                                 RCIE_bit            _BIT_ACCESS(PIE3,5)
// PIR3<RCIF>
extern volatile __bit                   RCIF                __at(0x387D);	// @ (0x70F * 8 + 5)
#define                                 RCIF_bit            _BIT_ACCESS(PIR3,5)
// NVMCON1<RD>
extern volatile __bit                   RD                  __at(0x40F0);	// @ (0x81E * 8 + 0)
#define                                 RD_bit              _BIT_ACCESS(NVMCON1,0)
// PORTD<RD0>
extern volatile __bit                   RD0                 __at(0x78);	// @ (0xF * 8 + 0)
#define                                 RD0_bit             _BIT_ACCESS(PORTD,0)
// RD0PPS<RD0PPS0>
extern volatile __bit                   RD0PPS0             __at(0x7940);	// @ (0xF28 * 8 + 0)
#define                                 RD0PPS0_bit         _BIT_ACCESS(RD0PPS,0)
// RD0PPS<RD0PPS1>
extern volatile __bit                   RD0PPS1             __at(0x7941);	// @ (0xF28 * 8 + 1)
#define                                 RD0PPS1_bit         _BIT_ACCESS(RD0PPS,1)
// RD0PPS<RD0PPS2>
extern volatile __bit                   RD0PPS2             __at(0x7942);	// @ (0xF28 * 8 + 2)
#define                                 RD0PPS2_bit         _BIT_ACCESS(RD0PPS,2)
// RD0PPS<RD0PPS3>
extern volatile __bit                   RD0PPS3             __at(0x7943);	// @ (0xF28 * 8 + 3)
#define                                 RD0PPS3_bit         _BIT_ACCESS(RD0PPS,3)
// RD0PPS<RD0PPS4>
extern volatile __bit                   RD0PPS4             __at(0x7944);	// @ (0xF28 * 8 + 4)
#define                                 RD0PPS4_bit         _BIT_ACCESS(RD0PPS,4)
// RD0PPS<RD0PPS5>
extern volatile __bit                   RD0PPS5             __at(0x7945);	// @ (0xF28 * 8 + 5)
#define                                 RD0PPS5_bit         _BIT_ACCESS(RD0PPS,5)
// PORTD<RD1>
extern volatile __bit                   RD1                 __at(0x79);	// @ (0xF * 8 + 1)
#define                                 RD1_bit             _BIT_ACCESS(PORTD,1)
// T1CON<RD161>
extern volatile __bit                   RD161               __at(0x1071);	// @ (0x20E * 8 + 1)
#define                                 RD161_bit           _BIT_ACCESS(T1CON,1)
// T3CON<RD163>
extern volatile __bit                   RD163               __at(0x10A1);	// @ (0x214 * 8 + 1)
#define                                 RD163_bit           _BIT_ACCESS(T3CON,1)
// T5CON<RD165>
extern volatile __bit                   RD165               __at(0x10D1);	// @ (0x21A * 8 + 1)
#define                                 RD165_bit           _BIT_ACCESS(T5CON,1)
// RD1PPS<RD1PPS0>
extern volatile __bit                   RD1PPS0             __at(0x7948);	// @ (0xF29 * 8 + 0)
#define                                 RD1PPS0_bit         _BIT_ACCESS(RD1PPS,0)
// RD1PPS<RD1PPS1>
extern volatile __bit                   RD1PPS1             __at(0x7949);	// @ (0xF29 * 8 + 1)
#define                                 RD1PPS1_bit         _BIT_ACCESS(RD1PPS,1)
// RD1PPS<RD1PPS2>
extern volatile __bit                   RD1PPS2             __at(0x794A);	// @ (0xF29 * 8 + 2)
#define                                 RD1PPS2_bit         _BIT_ACCESS(RD1PPS,2)
// RD1PPS<RD1PPS3>
extern volatile __bit                   RD1PPS3             __at(0x794B);	// @ (0xF29 * 8 + 3)
#define                                 RD1PPS3_bit         _BIT_ACCESS(RD1PPS,3)
// RD1PPS<RD1PPS4>
extern volatile __bit                   RD1PPS4             __at(0x794C);	// @ (0xF29 * 8 + 4)
#define                                 RD1PPS4_bit         _BIT_ACCESS(RD1PPS,4)
// RD1PPS<RD1PPS5>
extern volatile __bit                   RD1PPS5             __at(0x794D);	// @ (0xF29 * 8 + 5)
#define                                 RD1PPS5_bit         _BIT_ACCESS(RD1PPS,5)
// PORTD<RD2>
extern volatile __bit                   RD2                 __at(0x7A);	// @ (0xF * 8 + 2)
#define                                 RD2_bit             _BIT_ACCESS(PORTD,2)
// RD2PPS<RD2PPS0>
extern volatile __bit                   RD2PPS0             __at(0x7950);	// @ (0xF2A * 8 + 0)
#define                                 RD2PPS0_bit         _BIT_ACCESS(RD2PPS,0)
// RD2PPS<RD2PPS1>
extern volatile __bit                   RD2PPS1             __at(0x7951);	// @ (0xF2A * 8 + 1)
#define                                 RD2PPS1_bit         _BIT_ACCESS(RD2PPS,1)
// RD2PPS<RD2PPS2>
extern volatile __bit                   RD2PPS2             __at(0x7952);	// @ (0xF2A * 8 + 2)
#define                                 RD2PPS2_bit         _BIT_ACCESS(RD2PPS,2)
// RD2PPS<RD2PPS3>
extern volatile __bit                   RD2PPS3             __at(0x7953);	// @ (0xF2A * 8 + 3)
#define                                 RD2PPS3_bit         _BIT_ACCESS(RD2PPS,3)
// RD2PPS<RD2PPS4>
extern volatile __bit                   RD2PPS4             __at(0x7954);	// @ (0xF2A * 8 + 4)
#define                                 RD2PPS4_bit         _BIT_ACCESS(RD2PPS,4)
// RD2PPS<RD2PPS5>
extern volatile __bit                   RD2PPS5             __at(0x7955);	// @ (0xF2A * 8 + 5)
#define                                 RD2PPS5_bit         _BIT_ACCESS(RD2PPS,5)
// PORTD<RD3>
extern volatile __bit                   RD3                 __at(0x7B);	// @ (0xF * 8 + 3)
#define                                 RD3_bit             _BIT_ACCESS(PORTD,3)
// RD3PPS<RD3PPS0>
extern volatile __bit                   RD3PPS0             __at(0x7958);	// @ (0xF2B * 8 + 0)
#define                                 RD3PPS0_bit         _BIT_ACCESS(RD3PPS,0)
// RD3PPS<RD3PPS1>
extern volatile __bit                   RD3PPS1             __at(0x7959);	// @ (0xF2B * 8 + 1)
#define                                 RD3PPS1_bit         _BIT_ACCESS(RD3PPS,1)
// RD3PPS<RD3PPS2>
extern volatile __bit                   RD3PPS2             __at(0x795A);	// @ (0xF2B * 8 + 2)
#define                                 RD3PPS2_bit         _BIT_ACCESS(RD3PPS,2)
// RD3PPS<RD3PPS3>
extern volatile __bit                   RD3PPS3             __at(0x795B);	// @ (0xF2B * 8 + 3)
#define                                 RD3PPS3_bit         _BIT_ACCESS(RD3PPS,3)
// RD3PPS<RD3PPS4>
extern volatile __bit                   RD3PPS4             __at(0x795C);	// @ (0xF2B * 8 + 4)
#define                                 RD3PPS4_bit         _BIT_ACCESS(RD3PPS,4)
// RD3PPS<RD3PPS5>
extern volatile __bit                   RD3PPS5             __at(0x795D);	// @ (0xF2B * 8 + 5)
#define                                 RD3PPS5_bit         _BIT_ACCESS(RD3PPS,5)
// PORTD<RD4>
extern volatile __bit                   RD4                 __at(0x7C);	// @ (0xF * 8 + 4)
#define                                 RD4_bit             _BIT_ACCESS(PORTD,4)
// RD4PPS<RD4PPS0>
extern volatile __bit                   RD4PPS0             __at(0x7960);	// @ (0xF2C * 8 + 0)
#define                                 RD4PPS0_bit         _BIT_ACCESS(RD4PPS,0)
// RD4PPS<RD4PPS1>
extern volatile __bit                   RD4PPS1             __at(0x7961);	// @ (0xF2C * 8 + 1)
#define                                 RD4PPS1_bit         _BIT_ACCESS(RD4PPS,1)
// RD4PPS<RD4PPS2>
extern volatile __bit                   RD4PPS2             __at(0x7962);	// @ (0xF2C * 8 + 2)
#define                                 RD4PPS2_bit         _BIT_ACCESS(RD4PPS,2)
// RD4PPS<RD4PPS3>
extern volatile __bit                   RD4PPS3             __at(0x7963);	// @ (0xF2C * 8 + 3)
#define                                 RD4PPS3_bit         _BIT_ACCESS(RD4PPS,3)
// RD4PPS<RD4PPS4>
extern volatile __bit                   RD4PPS4             __at(0x7964);	// @ (0xF2C * 8 + 4)
#define                                 RD4PPS4_bit         _BIT_ACCESS(RD4PPS,4)
// RD4PPS<RD4PPS5>
